{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3, "batch_input_shape": [null, 64, 64, 3], "border_mode": "valid", "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 32, "trainable": true, "name": "convolution2d_1", "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 64, "trainable": true, "name": "convolution2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 128, "trainable": true, "name": "convolution2d_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 256, "trainable": true, "name": "convolution2d_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_4"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 512, "W_constraint": null, "init": "he_normal", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "name": "dense_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 128, "W_constraint": null, "init": "he_normal", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "name": "dense_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 16, "W_constraint": null, "init": "he_normal", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "name": "dense_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "name": "dense_4"}}], "keras_version": "1.1.2"}